<template>
  <div class="login">
    <div class="login-header safeContent">
      <div style="box-sizing: border-box; cursur:pointer; display:flex; align-items:center" @click="toIndex">
        <img src="../assets/imgs/logo-desgin.png" alt="" title="点击回到主页" />
        <span>欢迎登陆</span>
      </div>

      <div>
        <svg
          t="1635254082116"
          class="icon"
          viewBox="0 0 1024 1024"
          version="1.1"
          xmlns="http://www.w3.org/2000/svg"
          p-id="2468"
          width="16"
          height="16"
        >
          <path
            d="M721.338182 350.859636a64.512 64.512 0 0 1 64.512 64.488728 64.512 64.512 0 0 1-129.000727 0 64.488727 64.488727 0 0 1 64.488727-64.488728zM495.592727 350.859636a64.465455 64.465455 0 1 1 0 128.977455 64.465455 64.465455 0 0 1 0-128.977455zM269.847273 350.859636a64.512 64.512 0 1 1 0 129.000728 64.512 64.512 0 0 1 0-129.000728z"
            fill="#E1251B"
            p-id="2469"
          ></path>
          <path
            d="M427.264 930.769455a32.116364 32.116364 0 0 1-28.299636-16.756364l-109.544728-192.069818a32.186182 32.186182 0 0 1 12.032-43.962182 32.116364 32.116364 0 0 1 43.962182 12.032l81.850182 143.429818 81.850182-143.429818c8.843636-15.499636 28.509091-20.945455 43.985454-12.032 15.476364 8.797091 20.852364 28.485818 12.032 43.962182l-109.568 192.069818a32.302545 32.302545 0 0 1-28.229818 16.756364h-0.069818z"
            fill="#E1251B"
            p-id="2470"
          ></path>
          <path
            d="M837.934545 737.024H540.439273c-17.826909 0-32.256-14.405818-32.256-32.256s14.429091-32.256 32.256-32.256h297.495272c42.146909 0 76.404364-32.814545 76.404364-73.146182V230.795636c0-40.308364-34.280727-73.076364-76.404364-73.076363H186.042182c-42.123636 0-76.381091 32.768-76.381091 73.076363v368.570182c0 40.308364 34.257455 73.146182 76.381091 73.146182h129.419636c17.826909 0 32.256 14.405818 32.256 32.256s-14.429091 32.256-32.256 32.256H186.042182c-77.684364 0-140.893091-61.719273-140.893091-137.634909V230.795636c0-75.869091 63.208727-137.588364 140.893091-137.588363h651.892363c77.684364 0 140.916364 61.719273 140.916364 137.588363v368.570182c0 75.938909-63.232 137.658182-140.916364 137.658182z"
            fill="#E1251B"
            p-id="2471"
          ></path>
        </svg>
        <em>登陆页面，调查问卷</em>
      </div>
    </div>
    <div class="tips">
      <svg
        t="1635255260586"
        class="icon"
        viewBox="0 0 1024 1024"
        version="1.1"
        xmlns="http://www.w3.org/2000/svg"
        p-id="3521"
        width="16"
        height="16"
      >
        <path
          d="M511.333 127.333c51.868 0 102.15 10.144 149.451 30.15 45.719 19.337 86.792 47.034 122.078 82.321 35.287 35.286 62.983 76.359 82.321 122.078 20.006 47.3 30.15 97.583 30.15 149.451s-10.144 102.15-30.15 149.451c-19.337 45.719-47.034 86.792-82.321 122.078-35.286 35.287-76.359 62.983-122.078 82.321-47.3 20.006-97.583 30.15-149.451 30.15s-102.15-10.144-149.451-30.15c-45.719-19.337-86.792-47.034-122.078-82.321-35.287-35.286-62.983-76.359-82.321-122.078-20.006-47.3-30.15-97.583-30.15-149.451s10.144-102.15 30.15-149.451c19.337-45.719 47.034-86.792 82.321-122.078 35.286-35.287 76.359-62.983 122.078-82.321 47.301-20.006 97.583-30.15 149.451-30.15m0-64c-247.424 0-448 200.576-448 448s200.576 448 448 448 448-200.576 448-448-200.576-448-448-448z"
          fill="#E1251B"
          p-id="3522"
        ></path>
        <path
          d="M543.334 576h-64.001l-31.246-320.047h128.025z"
          fill="#E1251B"
          p-id="3523"
        ></path>
        <path
          d="M512.099 702.965m-40 0a40 40 0 1 0 80 0 40 40 0 1 0-80 0Z"
          fill="#E1251B"
          p-id="3524"
        ></path>
      </svg>
      <span
        >依据《网络安全法》，为保障您的账户安全和正常使用，请尽快完成手机号验证！
        新版《哒哒利亚隐私政策》已上线，将更有利于保护您的个人隐私。</span
      >
    </div>
    <div class="login-content">
        <img src="../assets/imgs/login-bg.png" alt="">
        <div class="login-form">
            <div class="tip">
                 <svg
                        t="1635255260586"
                        class="icon"
                        viewBox="0 0 1024 1024"
                        version="1.1"
                        xmlns="http://www.w3.org/2000/svg"
                        p-id="3521"
                        width="16"
                        height="16"
                    >
                        <path
                        d="M511.333 127.333c51.868 0 102.15 10.144 149.451 30.15 45.719 19.337 86.792 47.034 122.078 82.321 35.287 35.286 62.983 76.359 82.321 122.078 20.006 47.3 30.15 97.583 30.15 149.451s-10.144 102.15-30.15 149.451c-19.337 45.719-47.034 86.792-82.321 122.078-35.286 35.287-76.359 62.983-122.078 82.321-47.3 20.006-97.583 30.15-149.451 30.15s-102.15-10.144-149.451-30.15c-45.719-19.337-86.792-47.034-122.078-82.321-35.287-35.286-62.983-76.359-82.321-122.078-20.006-47.3-30.15-97.583-30.15-149.451s10.144-102.15 30.15-149.451c19.337-45.719 47.034-86.792 82.321-122.078 35.286-35.287 76.359-62.983 122.078-82.321 47.301-20.006 97.583-30.15 149.451-30.15m0-64c-247.424 0-448 200.576-448 448s200.576 448 448 448 448-200.576 448-448-200.576-448-448-448z"
                        fill="#E1251B"
                        p-id="3522"
                        ></path>
                        <path
                        d="M543.334 576h-64.001l-31.246-320.047h128.025z"
                        fill="#E1251B"
                        p-id="3523"
                        ></path>
                        <path
                        d="M512.099 702.965m-40 0a40 40 0 1 0 80 0 40 40 0 1 0-80 0Z"
                        fill="#E1251B"
                        p-id="3524"
                        ></path>
                    </svg>
                    <span>哒哒利亚不会要求您转账汇款，谨防诈骗。</span>
            </div>
             <div class="login-type">
                    <span>扫码登陆</span>
                    <em>|</em>
                    <span>账密登陆</span>
                </div>
            <div class="form-content">
                    <div class="input">
                        <div class="input-header">
                            <svg t="1635257241174" class="icon" viewBox="0 0 1028 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2441" width="16" height="16"><path d="M815.814506 299.350645c0 165.306834-134.011812 299.350645-299.350645 299.350645s-299.350645-134.011812-299.350645-299.350645c0-165.306834 134.011812-299.350645 299.350645-299.350645s299.350645 134.011812 299.350645 299.350645z" p-id="2442" fill="#8a8a8a"></path><path d="M763.52814 612.780851c-69.75782 55.070279-156.219118 85.661323-247.064279 85.661323-91.901128 0-179.1944-31.295022-249.27221-87.421268-184.698228 67.805881-267.19165 304.758476-267.19165 412.979094l1027.711884 0c0-107.260648-83.133402-342.549295-264.183744-411.18715z" p-id="2443" fill="#8a8a8a"></path></svg>
                        </div>
                        <input type="text" v-model="username" placeholder="手机号/邮箱/手机号">
                    </div>
                    <div class="input">
                        <div class="input-header">
                           <svg t="1635257668759" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="3760" width="18" height="18"><path d="M808.43536 370.238386H215.56464A127.218476 127.218476 0 0 0 88.889833 496.913194V897.053358a126.946642 126.946642 0 0 0 126.674807 126.402973h592.87072A126.946642 126.946642 0 0 0 935.110167 897.053358V496.913194a127.218476 127.218476 0 0 0-126.674807-126.674808z m-244.650916 347.947969v131.295992h-104.384391v-131.567826a105.743563 105.743563 0 1 1 105.199894 0z" p-id="3761" fill="#8a8a8a"></path><path d="M790.766127 373.772233h-81.550305v-95.142023a197.079904 197.079904 0 0 0-394.159809 0v95.142023h-81.550306v-95.142023a278.63021 278.63021 0 0 1 557.26042 0z" p-id="3762" fill="#8a8a8a"></path></svg>
                        </div>
                        <input type="password" v-model='password' placeholder="请输入密码">
                    </div>
                    <p style="text-align: right ;margin-top:13px"><span>忘记密码</span></p>
                    <div class="input">
                        <button @click="login" @keyup.enter='login'>登    陆</button>
                    </div>
            </div>
            <div class="login-footer">
                <div class="qqWeChat">
                    <div class="qq">
                      <svg t="1635296611599" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="8901" width="18" height="18"><path d="M512 0C229.003636 0 0 229.003636 0 512s229.003636 512 512 512 512-229.003636 512-512S794.996364 0 512 0z m210.385455 641.396364c-7.447273 9.309091-26.996364-1.861818-41.89091-32.581819-3.723636 13.963636-13.032727 36.305455-34.443636 64.232728 35.374545 8.378182 44.683636 42.821818 33.512727 61.44-8.378182 13.032727-26.996364 24.203636-59.578181 24.203636-58.647273 0-83.781818-15.825455-95.883637-26.996364-1.861818-2.792727-5.585455-3.723636-10.24-3.723636-4.654545 0-7.447273 0.930909-10.24 3.723636-11.170909 11.170909-37.236364 26.996364-95.883636 26.996364-32.581818 0-52.130909-11.170909-59.578182-24.203636-12.101818-18.618182-1.861818-53.061818 33.512727-61.44-20.48-27.927273-29.789091-50.269091-34.443636-64.232728-13.963636 30.72-34.443636 42.821818-41.890909 32.581819-5.585455-8.378182-8.378182-26.065455-7.447273-38.167273 3.723636-46.545455 34.443636-85.643636 53.061818-106.123636-2.792727-5.585455-8.378182-40.029091 14.894546-63.301819v-1.861818c0-92.16 65.163636-158.254545 148.014545-158.254545 81.92 0 148.014545 66.094545 148.014546 158.254545v1.861818c23.272727 23.272727 17.687273 57.716364 14.894545 63.301819 17.687273 20.48 49.338182 59.578182 53.061818 106.123636 0.930909 12.101818-0.930909 29.789091-7.447272 38.167273z" fill="#30A5DD" p-id="8902"></path></svg>
                      <span :style="{'width': textColor}">QQ</span>
                    </div>
                    <span style="margin:0 10px">|</span>
                    <div class="weChat">
                        <svg t="1635296415176" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="6385" width="18" height="18"><path d="M337.387283 341.82659c-17.757225 0-35.514451 11.83815-35.514451 29.595375s17.757225 29.595376 35.514451 29.595376 29.595376-11.83815 29.595376-29.595376c0-18.49711-11.83815-29.595376-29.595376-29.595375zM577.849711 513.479769c-11.83815 0-22.936416 12.578035-22.936416 23.6763 0 12.578035 11.83815 23.676301 22.936416 23.676301 17.757225 0 29.595376-11.83815 29.595376-23.676301s-11.83815-23.676301-29.595376-23.6763zM501.641618 401.017341c17.757225 0 29.595376-12.578035 29.595376-29.595376 0-17.757225-11.83815-29.595376-29.595376-29.595375s-35.514451 11.83815-35.51445 29.595375 17.757225 29.595376 35.51445 29.595376zM706.589595 513.479769c-11.83815 0-22.936416 12.578035-22.936416 23.6763 0 12.578035 11.83815 23.676301 22.936416 23.676301 17.757225 0 29.595376-11.83815 29.595376-23.676301s-11.83815-23.676301-29.595376-23.6763z" fill="#28C445" p-id="6386"></path><path d="M510.520231 2.959538C228.624277 2.959538 0 231.583815 0 513.479769s228.624277 510.520231 510.520231 510.520231 510.520231-228.624277 510.520231-510.520231-228.624277-510.520231-510.520231-510.520231zM413.595376 644.439306c-29.595376 0-53.271676-5.919075-81.387284-12.578034l-81.387283 41.433526 22.936416-71.768786c-58.450867-41.433526-93.965318-95.445087-93.965317-159.815029 0-113.202312 105.803468-201.988439 233.803468-201.98844 114.682081 0 216.046243 71.028902 236.023121 166.473989-7.398844-0.739884-14.797688-1.479769-22.196532-1.479769-110.982659 1.479769-198.289017 85.086705-198.289017 188.67052 0 17.017341 2.959538 33.294798 7.398844 49.572255-7.398844 0.739884-15.537572 1.479769-22.936416 1.479768z m346.265896 82.867052l17.757225 59.190752-63.630058-35.514451c-22.936416 5.919075-46.612717 11.83815-70.289017 11.83815-111.722543 0-199.768786-76.947977-199.768786-172.393063-0.739884-94.705202 87.306358-171.653179 198.289017-171.65318 105.803468 0 199.028902 77.687861 199.028902 172.393064 0 53.271676-34.774566 100.624277-81.387283 136.138728z" fill="#28C445" p-id="6387"></path></svg>
                        <span>微信</span>
                    </div>
                </div>
                <div class="register" @click="GoRegister">
                    <span style="font-weight: bolder;color: #e1251B" >立即注册</span>
                </div>
            </div>
        </div>
    </div>
    <div class="footer">
        <p>关于我们 | 联系我们 | 人才招聘 | 商家入驻 | 广告服务 | 友情链接 | 销售联盟 | 哒哒利亚社区 | 哒哒利亚公益 | English Site</p>
        <p>Copyright © 2021-2021  达达利亚小组 版权所有</p>
    </div>
  </div>
</template>
<script>
export default {
  name: "Login",
  data() {
    return {
      username: '',
      password: '',
      textColor: '10px'
    }
  },
  created() {
    let that = this
    document.onkeydown = function (e) {
      e = window.event || e
      //保证是在登录页面发出的enter事件
      if ((that.$route.path === '/login'||that.$route.path === '/') && (e.code === 'Enter' || e.code === 'enter')) {
        //调用登录函数
        that.login();
      }
      }
  },
  methods: {
      login() {
          this.yhRequest.get(`/api/user/login/${this.username}&${this.password}`).then((res) => {
            if(res) {
              this.$cookie.set('userId',res.userId,{expires:'Session'})
              this.$store.dispatch('saveUser', res)
              this.$message.success(`欢迎您,${res.userName}！`)
              this.$router.push('/')
            } else {
              this.$message.error('登录失败，请检查账号密码')
            }
          })
          console.log(this.username+this.password)
      },
      toIndex() {
          this.$router.push('/')
      },
      GoRegister() {
        this.$router.push('/register')
      }
  
  }
};
</script>
<style scoped lang='scss'>
.login {
  background-color: #fff;
  .login-header {
    display: flex;
    align-items: center;
    justify-content: space-between;
    padding: 10px 0 0 0;
    box-sizing: border-box;
    img {
      width: 180px;
      height: 95px;
    }
    span {
      font-size: 24px;
      color: #666;
      display: inline-block;
    }
    svg{
        vertical-align: middle;     
    }
  }
  .tips {
    height: 45px;
    line-height: 45px;
    width: 100%;
     color: #999;
    margin: auto;
    text-align: center;
    background-color: #fff8f0;
    svg{
        vertical-align: middle;
        margin-right: 5px;
    }
  }
  .login-content {
    position: relative;
    width: 100%;
    height: 475px;
    background: #e93854;
    text-align: center;
    .login-form {
        position: absolute;
        right: 120px;
        top: 40px;
        background-color: #fff;
        width: 346px;
        box-sizing: border-box;
        .tip{
            height: 40px;
            line-height: 40px;
            width: 100%;
            margin: auto;
            color: #999;
            text-align: center;
            background-color: #fff8f0;
            svg{
                vertical-align: middle;
                margin-right: 5px;
            }
        }
        .login-type{
                display: flex;
                align-items: center;
                justify-content: space-between;
                color: #666;
                height: 50px;
                border-bottom: 1px solid #e5e5e5;
                span {
                    width: 200px;
                    text-align: center;
                    font-size: 18px;
                    &:hover {
                    font-weight: bolder;
                    }
                }
            }
        .form-content   {
            padding: 10px 20px 20px 10px;
            
                .input {
                    margin-top: 25px;
                    display: flex;
                    justify-content: space-between;
                    height: 40px;
                    line-height: 40px;
                    border: 1px solid #999990;
                    .input-header {
                        display: inline-block;
                        width: 40px;
                        height: 40px;
                        background-color: #e5e5e5;
                        border-right: 1px solid #999;
                    }
                    input {
                        font-size: 14px;
                        width: 262px;
                        height: 100%;
                        border: none;
                        margin-left: 8px;
                        svg{
                            vertical-align: middle;
                        }
                    }
                    button{
                        width: 100%;
                        height: 100%;
                        border: none;
                        cursor: pointer;
                        background-color: #E4393c;
                        color: #fff;
                        font-size: 18px;
                    }
                }
            
        }
        .login-footer {
            display: flex;
            align-items: center;
            justify-content: space-between;
            height: 50px;
            padding: 10px 15px;
            box-sizing: border-box;
            color: #666;
            background-color: #fcfcf9;
            border-top:1px solid #f4f4f4;
            .qqWeChat {
                
                .qq{
                    display: inline-block;
                    svg {
                        margin-right: 5px;
                        vertical-align: middle;
                    }
                }
                .weChat {
                    display: inline-block;
                    svg {
                        margin-right: 5px;
                        vertical-align: middle;
                    }
                }
            }
            .register  {
                span {
                  display: inline-block;
                  transition: all .3s;
                }
                span:hover {
                    transform: scale(1.2);
                }
            }
        }
    }
  }
  .footer{
      margin-top: 10px;
      text-align: center;
      p{
          margin-top:10px;
      }
  }
}
</style>
